## Target env: terraform/env/eks
#### Terraform Init `success`
#### Terraform Validate `success`
#### Terraform Plan `failure`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.vpc: Reading...
module.eks.data.aws_iam_policy_document.assume_role: Reading...
data.aws_caller_identity.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=189502314]
data.aws_caller_identity.current: Read complete after 0s [id=686355260515]
data.terraform_remote_state.vpc: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.cluster_encription_key.aws_kms_key.key will be created
  + resource "aws_kms_key" "key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = (known after apply)
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.cluster_encription_key.aws_kms_key_policy.key_policy will be created
  + resource "aws_kms_key_policy" "key_policy" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = "\"{\\n    Statement = [\\n      {\\n        Action = \\\"kms:*\\\"\\n        Effect = \\\"Allow\\\"\\n        Principal = {\\n          \\\"AWS\\\" = arn:aws:sts::686355260515:assumed-role/AllowAccessFromIpro2023/GitHubActions\\\"\\n          }\\n\\n        Resource = \\\"*\\\"\\n        Sid      = \\\"EKS Cluster Encription Key\\\"\\n      },\\n    ]\\n    Version = \\\"2012-10-17\\\"\\n}\\n\""
    }

  # module.eks.aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-role"
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-cluster-role"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```

</details>